Revit 2026 API

# CompoundStructureGetRegionsAssociatedToLayer Method

---

Gets the set of region ids associated to a particular layer.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<int> GetRegionsAssociatedToLayer(
	int layerIdx
)
```
```vb
Public Function GetRegionsAssociatedToLayer (
	layerIdx As Integer
) As IList(Of Integer)
```
```cpp
public:
IList<int>^ GetRegionsAssociatedToLayer(
	int layerIdx
)
```
```fsharp
member GetRegionsAssociatedToLayer :
        layerIdx : int -> IList<int>
```

#### Parameters

layerIdx Int32
     Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.

#### Return Value

IListInt32 An array of region ids which are associated to the specified layer.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The layer index is out of range. |

Regions are associated to layers. In a vertically compound structure, more than one region may be associated to a single layer.

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace